---
kind: method
id: M:Autodesk.Revit.DB.OBJExportOptions.IsMaxEdgeLengthSet
source: html/fbe632a0-b829-a24d-1e12-32b1de7f3ed8.htm
---
# Autodesk.Revit.DB.OBJExportOptions.IsMaxEdgeLengthSet Method

Checks whether the MaxEdgeLength tessellation parameter is explicitly set.

## Syntax (C#)
```csharp
public bool IsMaxEdgeLengthSet()
```

## Returns
True if MaxEdgeLength tessellation parameter is explicitly set, false otherwise.